update: vpc docs
